# 题目2：企业发放的奖金根据利润提成。
# 1.利润(I)低于或等于10万元时，奖金可提10%；
# 2.利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
# 3.20万到40万之间时，高于20万元的部分，可提成5%；
# 4.40万到60万之间时高于40万元的部分，可提成3%；
# 5.60万到100万之间时，高于60万元的部分，可提成1.5%，
# 6.高于100万元时，超过100万元的部分按1%提成，
# 从键盘输入当月利润I，求应发放奖金总数？

def income(x):
    # 方案1
    # l1 = 100000
    # l2 = 200000
    # l3 = 400000
    # l4 = 600000
    # l5 = 1000000
    # if x <= l1:
    #     y = x * 0.1
    # elif l1 < x <= l2:
    #     y = l1 * 0.1 + (x - l1) * 0.075
    # elif l2 < x <= l3:
    #     y = l1 * 0.1 + (l2 - l1) * 0.075 + (x - l2) * 0.05
    # elif l3 < x <= l4:
    #     y = l1 * 0.1 + (l2 - l1) * 0.075 + (l3 - l2) * 0.05 + (x - l3) * 0.03
    # elif l4 < x <= l5:
    #     y = l1 * 0.1 + (l2 - l1) * 0.075 + (l3 - l2) * 0.05 + (l4 - l3) * 0.03 + (x - l4) * 0.015
    # elif x > l5:
    #     y = l1 * 0.1 + (l2 - l1) * 0.075 + (l3 - l2) * 0.05 + (l4 - l3) * 0.03 + (l5 - l4) * 0.015 + (x - l5) * 0.01
    # return y

    # 方案2
    profit_list = [1000000, 600000, 400000, 200000, 100000, 0]
    rate_list = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]
    y = 0
    for i in range(6):
        if x >= profit_list[i]:
            y += (x - profit_list[i]) * rate_list[i]
            x = profit_list[i]
    return y

if __name__ == '__main__':
    x = int(input("请输入利润数值："))
    print(income(x))

